app/controllers/application_controller.rb

SELECT  `global_property`.* FROM `global_property` WHERE `global_property`.`property` = 'current_health_center_id' ORDER BY `global_property`.`property` ASC LIMIT 1
---
  def check_location
    location_id = GlobalProperty.where(property: CURRENT_LOCATION_PROPERTY).first.property_value